Repository: Gil-Tayar/HeverTeamimTelegramBot
Catalog: locale/*/LC_MESSAGES/bot.po
Languages: he

source: Yellow (Hever shel Keva)
he: צהוב (חבר של קבע)

source: Blue (Teamim)
he: כחול (טעמים)

source: The credit card details are invalid. Can't charge card
he: פרטי כרטיס האשראי אינם תקינים. לא ניתן להטעין את הכרטיס

source: Charging failed due to an unknown error
he: הטענת הכרטיס נכשלה מסיבה שאינה ידועה

source: Switch card
he: החלף כרטיס

source: Charge card
he: טען כרטיס

source: Fill card
he: מלא כרטיס

source: Confirm, charge card
he: מאשר, טען כרטיס

source: Cancel
he: ביטול

source: Welcome!
he: ברוך הבא!

source: {} Selected card: {}
he: {} כרטיס שנבחר: {}

source: Current balance: ₪{balance:.2f} Chargeable this month: ₪{chargeable-monthly:.2f} Chargeable right now: ₪{chargeable-now:.2f}
he: יתרה נוכחית: ₪{balance:.2f} יתרה לטעינה החודש: ₪{chargeable-monthly:.2f} יתרה לטעינה נוכחית: ₪{chargeable-now:.2f}

source: Current charge rates: {:.0%} and {:.0%}
he: אחוזי חיוב נוכחיים לטעינה: {:.0%} ו-{:.0%}

source: Sorry, what were we talking about?
he: סליחה, על מה דיברנו?

source: Switched card!
he: החלפתי כרטיס!

source: With how much?
he: בכמה?

source: How much is your bill?
he: כמה יצא לך החשבון?

source: Charging your card...
he: מטעין את הכרטיס...

source: Card charged successfully!
he: הכרטיס הוטען בהצלחה!

source: Start again?
he: שנתחיל שוב?

source: You have enough money, have fun!
he: יש לך מספיק כסף, תהנה!

source: Sorry, but you can't charge your %s card right now with any amount. You have ₪%.2f left
he: סליחה, אבל אי אפשר להטעין כרגע את הכרטיס ה%s באף סכום. נותרו לך ₪%.2f

source: We can't charge your %s card with enough right now, but can charge it with ₪%.2f and fill it to ₪%.2f
he: אי אפשר כרגע למלא לך את הכרטיס ה%s לסכום הדרוש, אבל אפשר להטעין אותו ב₪%.2f ולמלא אותו ל-₪%.2f

source: We'll charge your %s card ₪%.2f to fill it to ₪%.2f.
he: אני מטעין לך את הכרטיס ה%s ב-₪%.2f כדי למלא אותו ל-₪%.2f.

source: Sorry, I got confused. Let me see a doctor
he: סליחה, התבלבלתי. תן לי לראות רופא
